"""
Конфигурационные данные для тестов
"""

# URL сервиса
BASE_URL = "https://qa-scooter.education-services.ru/"

# Данные для вопросов
QUESTIONS_DATA = [
    (0, "Сколько стоит аренда самоката?"),
    (1, "Хочу сразу несколько самокатов! Так можно?"),
    (2, "Как рассчитать время аренды?"),
    (3, "Можно ли продлить заказ?"),
    (4, "Вы привозите зарядку вместе с самокатом?"),
    (5, "Можно ли отменить заказ?"),
    (6, "Я жизу за МКАДом, привезёте?"),
    (7, "Самокат приезжает в собранном виде?")
]

# Данные для заказов
ORDERS_DATA = [
    {
        "name": "Иван",
        "surname": "Петров",
        "address": "ул. Ленина 1",
        "metro": "Сокольники",
        "phone": "+79111111111",
        "date": "20.07.2026",
        "rental_period": "сутки",
        "color": "чёрный",
        "comment": "Позвоните за 10 минут",
        "button": "top"
    },
    {
        "name": "Мария",
        "surname": "Смирнова",
        "address": "пр. Вернадского 15",
        "metro": "Парк культуры",
        "phone": "+79222222222",
        "date": "22.07.2026",
        "rental_period": "пятеро суток",
        "color": "серый",
        "comment": "Оставьте у консьержа",
        "button": "bottom"
    }
]